Revit 2027 API
RebarHookType.StraightLineMultiplier Property
 Multiplier of bar diameter. Used to compute a default hook length. The default hook length can be overridden by the RebarBarType class.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double StraightLineMultiplier { get; set; }
Public Property StraightLineMultiplier As Double
	Get
	Set
public:
property double StraightLineMultiplier {
	double get ();
	void set (double value);
}
member StraightLineMultiplier : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for straightLineMultiplier is not a number
ArgumentOutOfRangeException |  When setting this property: straightLineMultiplier must be greater than 0 and no more than 99.
See Also
Reference
RebarHookType Class
Autodesk.Revit.DB.Structure Namespace